01 character-record.
  02 short-name   PIC X(10).
  02 long-name    PIC X(21).
  02 task         PIC X(10).
  02 team         PIC X(20).
  02 level        PIC 99.
  02 experience   PIC 99.
  02 energy       PIC 9V99.
    88 exhausted  VALUE 00 THROUGH 24.
    88 tired      VALUE 25 THROUGH 50.
    88 fine       VALUE 51 THROUGH 100.
  02 power        PIC 99.
  02 focus        PIC 99.
  02 speed        PIC 99.
  02 character-type PIC X(6).
